{ "notes" : [ "<p>The <code>ACTIVE_INSTANCE_COUNT</code> parameter is deprecated. It is retained for backward compatibility only.</p>", "<p>This parameter functions only in a cluster with only two instances.</p>" ], "property" : { "Oracle RAC" : "You must set this parameter for every instance, and multiple instances must have the same value.", "Modifiable in a PDB" : "No", "Modifiable" : "No", "Parameter type" : "Integer", "Range of values" : "1 or &gt;= the number of instances in the cluster. (Values other than 1 have no effect on the active or standby status of any instances.)", "Default value" : "There is no default value.", "Basic" : "No" }, "section" : "<div class=\"infobox-note\" id=\"GUID-74B33671-D6EA-469D-95E8-80AA56CC3F6F__GUID-9F0C80B1-27E6-4A9D-B75C-E67F346DB3EC\">\n<p class=\"notep1\">Note:</p>\n<p>The <code>ACTIVE_INSTANCE_COUNT</code> parameter is deprecated. It is retained for backward compatibility only.</p>\n</div>\n<p><code>ACTIVE_INSTANCE_COUNT</code> enables you to designate one instance in a two-instance cluster as the primary instance and the other instance as the secondary instance. This parameter has no functionality in a cluster with more than two instances.</p>\n<p>When you set this parameter to 1, the first instance you start up becomes the primary instance and accepts client connections. The second instance starts up as a secondary instance and can accept client connections only if the first instance fails. In such an event, the secondary instance becomes the primary instance.</p>\n<p>When the failed instance can once again be started up, it starts up as the secondary instance, and will not accept client connections unless the current primary instance fails.</p>\n<div class=\"infobox-note\" id=\"GUID-74B33671-D6EA-469D-95E8-80AA56CC3F6F__GUID-DF9009FA-1A47-4F57-98F1-5DA553A55290\">\n<p class=\"notep1\">Note:</p>\n<p>This parameter functions only in a cluster with only two instances.</p>\n</div>\n</div>\n<!-- class=\"section\" --></div>\n</div>\n<!-- class=\"ind\" --><!-- Start Footer -->\n</div>\n<!-- add extra wrapper close div-->" }