{ "property" : { "Modifiable in a PDB" : "No", "Modifiable" : "No", "Parameter type" : "String", "Range of values" : "One or more IP addresses, separated by colons", "Default value" : "There is no default value.", "Syntax" : "<code>CLUSTER_INTERCONNECTS =</code> <span class=\"italic\"><code>ifn</code></span> <code>[:</code> <span class=\"italic\"><code>ifn</code></span> <code>] ...</code>", "Basic" : "No" }, "section" : "<p><code>CLUSTER_INTERCONNECTS</code> can be used in Oracle Real Application Clusters environments to indicate cluster interconnects available for use for the database traffic. Use this parameter to override the default interconnect configured for the database traffic, which is stored in the cluster registry. This procedure also may be useful with Data Warehouse systems that have reduced availability requirements and high interconnect bandwidth demands.</p>\n<p><code>CLUSTER_INTERCONNECTS</code> specifically overrides the following:</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p>Network classifications stored by <code>oifcfg</code> in the OCR.</p>\n</li>\n<li>\n<p>The default interconnect chosen by Oracle.</p>\n</li>\n</ul>\n<p>If you want to load-balance the interconnect, then Oracle recommends that you use link-bonding at the operating system level, even if you have two databases on the same server, so that multiple interconnects use the same address. Note that multiple private addresses provide load balancing, but do not provide failover unless bonded. If you specify multiple addresses in init.ora using <code>CLUSTER_INTERCONNECTS</code>, instead of bonding multiple addresses at the operating system level, then typically availability is reduced, because each network interface card failure will take down that instance.</p>\n<p>Refer to your vendor documentation for information about bonding interfaces. Some vendor bonding architectures may require the use of this parameter.</p>\n<p>If you have multiple database instances on Oracle Real Application Clusters nodes and want to use a specific interface for each instance, then you can set the <code>CLUSTER_INTERCONNECTS</code> initialization parameter to the IP address for each database instance. For example:</p>\n<pre dir=\"ltr\">\nhr1.init.ora.cluster_interconnects=\"192.0.2.111\"\noltp3.init.ora.cluster_interconnects=\"192.0.2.112\"\n</pre>\n<p>If the Oracle RAC interconnect is configured to run on a different interface than the Oracle Clusterware interconnect, then this configuration can cause reduced availability, as failovers or instance evictions can be delayed if the Oracle RAC interconnect fails while the Oracle Clusterware NIC remains up.</p>\n<div class=\"infoboxnotealso\" id=\"GUID-6B0B0F1D-3DB0-415B-B914-2649FE02E4DA__GUID-B64D3785-4264-461F-8AD0-FE443CAF177F\">\n<p class=\"notep1\">See Also:</p>\n<p><a class=\"olink RACAD7296\" target=\"_blank\" href=\"../RACAD/administering-database-instances-and-cluster-databases.htm#RACAD7296\"><span class=\"italic\">Oracle Real Application Clusters Administration and Deployment Guide</span></a> for additional information about using <code>CLUSTER_INTERCONNECTS</code></p>\n</div>\n</div>\n<!-- class=\"section\" --></div>\n</div>\n<!-- class=\"ind\" --><!-- Start Footer -->\n</div>\n<!-- add extra wrapper close div-->", "seealso" : [ "<p><a class=\"olink RACAD7296\" target=\"_blank\" href=\"../RACAD/administering-database-instances-and-cluster-databases.htm#RACAD7296\"><span class=\"italic\">Oracle Real Application Clusters Administration and Deployment Guide</span></a> for additional information about using <code>CLUSTER_INTERCONNECTS</code></p>" ] }