{ "notes" : [ "<p>The <code>COMMIT_WRITE</code> parameter is deprecated. It is retained for backward compatibility only. It is replaced by the <code>COMMIT_LOGGING</code> and <code>COMMIT_WAIT</code> parameters.</p>" ], "property" : { "Oracle RAC" : "Each instance may have its own setting", "Modifiable in a PDB" : "Yes", "Modifiable" : "Yes (at both session-level and system-level). Values supplied for <code>COMMIT_WRITE</code> in an <code>ALTER SYSTEM</code> or <code>ALTER SESSION</code> statement must be separated by a comma.", "Parameter type" : "String", "Range of values" : "Single-quoted, comma-separated list of either <code>IMMEDIATE</code> or <code>BATCH</code>, and either <code>WAIT</code> or <code>NOWAIT</code>.", "Default value" : "If this parameter is not explicitly specified, then database commit behavior defaults to writing commit records to disk before control is returned to the client.</p>\n<p>If only <code>IMMEDIATE</code> or <code>BATCH</code> is specified, but not <code>WAIT</code> or <code>NOWAIT</code>, then <code>WAIT</code> mode is assumed.</p>\n<p>If only <code>WAIT</code> or <code>NOWAIT</code> is specified, but not <code>IMMEDIATE</code> or <code>BATCH</code>, then <code>IMMEDIATE</code> mode is assumed.</p>\n<p>Be aware that the <code>NOWAIT</code> option can cause a failure that occurs after the database receives the commit message, but before the redo log records are written. This can falsely indicate to a transaction that its changes are persistent. Also, it can violate the durability of ACID (Atomicity, Consistency, Isolation, Durability) transactions if the database shuts down unexpectedly.", "Syntax" : "<code>COMMIT_WRITE = '{IMMEDIATE | BATCH},{WAIT |NOWAIT}'</code>", "Basic" : "No" }, "section" : "<p><code>COMMIT_WRITE</code> is an advanced parameter used to control how redo for transaction commits is written to the redo logs. The <code>IMMEDIATE</code> and <code>BATCH</code> options control how redo is batched by Log Writer. The <code>WAIT</code> and <code>NOWAIT</code> options control when the redo for a commit is flushed to the redo logs.</p>\n<div class=\"infobox-note\" id=\"GUID-F392FBE5-848D-439E-B470-73A5FEC31C61__GUID-B2FA0B0A-92EC-4C42-8A01-ED6EAADF6206\">\n<p class=\"notep1\">Note:</p>\n<p>The <code>COMMIT_WRITE</code> parameter is deprecated. It is retained for backward compatibility only. It is replaced by the <code>COMMIT_LOGGING</code> and <code>COMMIT_WAIT</code> parameters.</p>\n</div>\n</div>\n<!-- class=\"section\" --></div>\n</div>\n<!-- class=\"ind\" --><!-- Start Footer -->\n</div>\n<!-- add extra wrapper close div-->" }