{ "property" : { "Modifiable in a PDB" : "Yes", "Modifiable" : "<code>ALTER SESSION</code>, <code>ALTER SYSTEM</code>", "Parameter type" : "String", "Default value" : "<code>PERMITTED if the COMPATIBLE initialization parameter is set to 11.2.0.1, 11.2.0.2, or 11.2.0.3, or PREFERRED if the COMPATIBLE initialization parameter is set to 12.0.0.0 or higher</code>", "Syntax" : "<code>DB_SECUREFILE = { NEVER | PERMITTED | PREFERRED | ALWAYS | IGNORE }</code>", "Basic" : "No" }, "section" : "<p><code>DB_SECUREFILE</code> specifies whether to treat LOB files as SecureFiles.</p>\n</div>\n<!-- class=\"section\" -->\n<div class=\"section\">\n<p class=\"subhead1\">Values</p>\n</div>\n<!-- class=\"section\" -->\n<div class=\"section\">\n<ul style=\"list-style-type: disc;\">\n<li>\n<p><code>NEVER</code></p>\n<p>Any LOBs that are specified as SecureFiles are created as BasicFiles LOBs. All SecureFiles-specific storage options and features (for example, compress, encrypt, deduplicate) will cause an exception. The BasicFiles LOB defaults will be used for storage options not specified.</p>\n</li>\n<li>\n<p><code>PERMITTED</code></p>\n<p>LOBs are allowed to be created as SecureFiles.</p>\n</li>\n<li>\n<p><code>PREFERRED</code></p>\n<p>All LOBs are created as SecureFiles unless <code>BASICFILE</code> is explicitly specified in the LOB storage clause or the tablespace is a Manual Segment Space Management tablespace. When <code>PREFERRED</code> is set, cases where <code>BASICFILE</code> would otherwise be inherited from the partition or column level LOB storage are ignored; the LOBs will be created as SecureFiles instead.</p>\n</li>\n<li>\n<p><code>ALWAYS</code></p>\n<p>Attempts to create all LOBs as SecureFiles LOBs but creates any LOBs not in an Automatic Segment Space Managed (ASSM) tablespace as BasicFiles LOBs, unless <code>SECUREFILE</code> is explicitly specified. Any BasicFiles LOB storage options that are specified will be ignored and the SecureFiles LOB defaults will be used for all storage options not specified.</p>\n</li>\n<li>\n<p><code>IGNORE</code></p>\n<p>The <code>SECUREFILE</code> keyword and all SecureFiles options are ignored.</p>\n</li>\n</ul>\n<p>If the <code>COMPATIBLE</code> initialization parameter is not set to <code>11.1.0</code> or higher, then LOBs are not treated as SecureFiles.</p>\n<p>If there is a LOB column with two partitions (one that has a tablespace for which ASSM is enabled and one that has a tablespace for which ASSM is not enabled), then LOBs in the partition with the ASSM-enabled tablespace will be treated as SecureFiles and LOBs in the other partition will be treated as BasicFiles.</p>\n<p>If an application is not certified with SecureFiles, the value of the <code>DB_SECUREFILE</code> initialization parameter can be set to <code>PERMITTED</code> to get the default behavior of Oracle Database 11<span class=\"italic\">g</span>.</p>\n<div class=\"infoboxnotealso\" id=\"GUID-6F7C5E21-3929-4AB1-9C72-1BB9BDDB011F__GUID-C899ECCA-1B40-40B1-B096-35FA9D94DEE1\">\n<p class=\"notep1\">See Also:</p>\n<p><a class=\"olink ADLOB46148\" target=\"_blank\" href=\"../ADLOB/using-oracle-LOBs-storage.htm#ADLOB46148\"><span class=\"italic\">Oracle Database SecureFiles and Large Objects Developer's Guide</span></a> for an example of setting this parameter using the <code>ALTER SYSTEM</code> statement</p>\n</div>\n</div>\n<!-- class=\"section\" --></div>\n</div>\n<!-- class=\"ind\" --><!-- Start Footer -->\n</div>\n<!-- add extra wrapper close div-->", "seealso" : [ "<p><a class=\"olink ADLOB46148\" target=\"_blank\" href=\"../ADLOB/using-oracle-LOBs-storage.htm#ADLOB46148\"><span class=\"italic\">Oracle Database SecureFiles and Large Objects Developer's Guide</span></a> for an example of setting this parameter using the <code>ALTER SYSTEM</code> statement</p>" ] }