{ "property" : { "Oracle RAC" : "All instances must have the same setting", "Modifiable in a PDB" : "No", "Modifiable" : "<code>ALTER SYSTEM</code>", "Parameter type" : "Boolean", "Range of values" : "<code>true | false</code>", "Default value" : "false", "Basic" : "No" }, "section" : "<p><code>ENABLE_GOLDENGATE_REPLICATION</code> controls services provided by the RDBMS for Oracle GoldenGate (both capture and apply services). Set this to <code>true</code> to enable RDBMS services used by Oracle GoldenGate.</p>\n<p>This parameter primarily controls supplemental logging required to support logical replication of new data types and operations. The redo log file is designed to be applied physically to a database, therefore the default contents of the redo log file often do not contain sufficient information to allow logged changes to be converted into SQL statements. Supplemental logging adds extra information into the redo log files so that replication can convert logged changes into SQL statements without having to access the database for each change. Previously these extra changes were controlled by the supplemental logging DDL. Now the <code>ENABLE_GOLDENGATE_REPLICATION</code> parameter must also be set to enable the required supplemental logging for any new data types or operations.</p>\n<p>All enhancements to supplemental logging required to support logical replication are also controlled by this parameter.</p>\n<p>The RDBMS services controlled by this parameter also include (but are not limited to):</p>\n<ul style=\"list-style-type: disc;\">\n<li>\n<p>Transparent Data Encryption (including Tablespace Encryption) utilities used by GoldenGate Extract</p>\n</li>\n<li>\n<p>Service to read redo logs used by GoldenGate Extract</p>\n</li>\n<li>\n<p>Service to suppress triggers used by GoldenGate Replicat</p>\n</li>\n<li>\n<p>Service to handle transient duplicate handling used by GoldenGate Replicat</p>\n</li>\n<li>\n<p>Service to bypass referential integrity checking used by GoldenGate Replicat</p>\n</li>\n<li>\n<p>Services required to run Oracle GoldenGate in Integrated Extract and Integrated Replicat</p>\n</li>\n</ul>\n<div class=\"infoboxnotealso\" id=\"GUID-600FC071-1516-49B2-B3B3-C1C5430C5917__GUID-7C4D6B8B-422F-46DA-8A21-0B57A9C7FBAE\">\n<p class=\"notep1\">See Also:</p>\n<p><a class=\"olink GIORA983\" target=\"_blank\" href=\"http://www.oracle.com/pls/topic/lookup?ctx=E66230-01&amp;id=GIORA983\"><span class=\"italic\">Oracle GoldenGate Installing and Configuring Oracle GoldenGate for Oracle Database</span></a> for more information about the <code>ENABLE_GOLDENGATE_REPLICATION</code> initialization parameter</p>\n</div>\n</div>\n<!-- class=\"section\" --></div>\n</div>\n<!-- class=\"ind\" --><!-- Start Footer -->\n</div>\n<!-- add extra wrapper close div-->", "seealso" : [ "<p><a class=\"olink GIORA983\" target=\"_blank\" href=\"http://www.oracle.com/pls/topic/lookup?ctx=E66230-01&amp;id=GIORA983\"><span class=\"italic\">Oracle GoldenGate Installing and Configuring Oracle GoldenGate for Oracle Database</span></a> for more information about the <code>ENABLE_GOLDENGATE_REPLICATION</code> initialization parameter</p>" ] }