{ "property" : { "Modifiable in a PDB" : "Yes", "Modifiable" : "<code>ALTER SESSION</code>, <code>ALTER SYSTEM</code>", "Parameter type" : "Integer", "Range of values" : "0 to 100", "Default value" : "<code>0</code>", "Basic" : "No" }, "section" : "<p><a id=\"d142673e228\" class=\"indexterm-anchor\"></a><a id=\"d142673e232\" class=\"indexterm-anchor\"></a><code>OPTIMIZER_INDEX_CACHING</code> lets you adjust the behavior of cost-based optimization to favor nested loops joins and IN-list iterators.</p>\n<p>The cost of executing an index using an IN-list iterator or of executing a nested loops join when an index is used to access the inner table depends on the caching of that index in the buffer cache. The amount of caching depends on factors that the optimizer cannot predict, such as the load on the system and the block access patterns of different users.</p>\n<p>You can modify the optimizer's assumptions about index caching for nested loops joins and IN-list iterators by setting this parameter to a value between 0 and 100 to indicate the percentage of the index blocks the optimizer should assume are in the cache. Setting this parameter to a higher value makes nested loops joins and IN-list iterators look less expensive to the optimizer. As a result, it will be more likely to pick nested loops joins over hash or sort-merge joins and to pick indexes using IN-list iterators over other indexes or full table scans. The default for this parameter is 0, which results in default optimizer behavior.</p>\n<div class=\"infoboxnotealso\" id=\"GUID-1601D366-1637-4235-98F6-57B4B7AD96D0__GUID-C5EEA56A-A87E-418D-83F3-E5B0ABBCAEE1\">\n<p class=\"notep1\">See Also:</p>\n<p><a class=\"olink SQLRF51119\" target=\"_blank\" href=\"../SQLRF/Comments.htm#SQLRF51119\"><span class=\"italic\">Oracle Database SQL Language Reference</span></a> for additional information about this initialization parameter</p>\n</div>\n</div>\n<!-- class=\"section\" --></div>\n</div>\n<!-- class=\"ind\" --><!-- Start Footer -->\n</div>\n<!-- add extra wrapper close div-->", "seealso" : [ "<p><a class=\"olink SQLRF51119\" target=\"_blank\" href=\"../SQLRF/Comments.htm#SQLRF51119\"><span class=\"italic\">Oracle Database SQL Language Reference</span></a> for additional information about this initialization parameter</p>" ] }