{ "notes" : [ "<p>This setting does not prevent your operating system from paging or swapping the SGA after it is initially read into memory.</p>" ], "property" : { "Modifiable in a PDB" : "No", "Modifiable" : "No", "Parameter type" : "Boolean", "Range of values" : "<code>true | false</code>", "Default value" : "<code>true</code>", "Basic" : "No" }, "section" : "<p><code>PRE_PAGE_SGA</code> determines whether Oracle reads the entire SGA into memory at instance startup. Operating system page table entries are then prebuilt for each page of the SGA. This setting can increase the amount of time necessary for instance startup, but it is likely to decrease the amount of time necessary for Oracle to reach its full performance capacity after startup.</p>\n<div class=\"infobox-note\" id=\"GUID-48C49E38-BE48-46FB-8654-493DE6D9987B__GUID-8EF2F73A-4F8E-43A4-A9B4-6A6C47914CFD\">\n<p class=\"notep1\">Note:</p>\n<p>This setting does not prevent your operating system from paging or swapping the SGA after it is initially read into memory.</p>\n</div>\n<p><code>PRE_PAGE_SGA</code> can increase the process startup duration, because every process that starts must access every page in the SGA. The cost of this strategy is fixed; however, you might simply determine that 20,000 pages must be touched every time a process starts. This approach can be useful with some applications, but not with all applications. Overhead can be significant if your system frequently creates and destroys processes by, for example, continually logging on and logging off.</p>\n<p>The advantage that <code>PRE_PAGE_SGA</code> can afford depends on page size. For example, if the SGA is 80 MB and the page size is 4 KB, then 20,000 pages must be touched to refresh the SGA (80,000/4 = 20,000).</p>\n<p>If the system permits you to set a 4 MB page size, then only 20 pages must be touched to refresh the SGA (80,000/4,000 = 20). The page size is operating system-specific and generally cannot be changed. Some operating systems, however, have a special implementation for shared memory whereby you can change the page size.</p>\n</div>\n<!-- class=\"section\" --></div>\n</div>\n<!-- class=\"ind\" --><!-- Start Footer -->\n</div>\n<!-- add extra wrapper close div-->" }