{ "property" : { "Oracle RAC" : "Each session of each instance can have its own value or not set any value at all", "Modifiable in a PDB" : "Yes", "Modifiable" : "<code>ALTER SESSION</code>, <code>ALTER SYSTEM</code>", "Parameter type" : "Boolean", "Range of values" : "<code>true | false</code>", "Default value" : "<code>false</code>", "Basic" : "No" }, "section" : "<p><code>TEMP_UNDO_ENABLED</code> determines whether transactions within a particular session can have a temporary undo log. The default choice for database transactions has been to have a single undo log per transaction. This parameter, at the session level / system level scope, lets a transaction split its undo log into temporary undo log (for changes on temporary objects) and permanent undo log (for changes on persistent objects).</p>\n<p>By splitting the undo stream of a transaction into two streams (temporary and permanent), a database can provide separate storage and retention model for these. This results in overall reduction in the size of undo log and redo log in the database</p>\n<p>If database applications make use of temporary objects (using global temporary tables or temporary table transformations), it is advisable to set this parameter's value to <code>true</code>.</p>\n<p>When <code>TEMP_UNDO_ENABLED</code> is set to <code>true</code> and the COMPATIBLE initialization parameter is set to <code>12.0.0</code>, this feature is enabled. The temporary undo feature is enabled for the session in which it is set. Setting it across the system will affect all existing and upcoming sessions. If the value is set in the <code>init.ora</code> file, all upcoming sessions will inherit this value unless overwritten by an explicit ALTER SESSION or ALTER SYSTEM statement. All undo for operations on temporary objects is deemed temporary.</p>\n<p>If <code>TEMP_UNDO_ENABLED</code> is not set to <code>true</code>, existing applications that make use of temporary objects run as is without any change.</p>\n<p>Once the value of the parameter is set, it cannot be changed for the lifetime of the session. If the session has temporary objects using temporary undo, the parameter cannot be disabled for the session. Similarly, if the session already has temporary objects using regular undo, setting this parameter will have no effect.</p>\n<p>This parameter is only applicable for the primary database. For a standby database, this parameter is ignored because temporary undo is enabled by default on the standby database.</p>\n<div class=\"infoboxnotealso\" id=\"GUID-E2A01A84-2D63-401F-B64E-C96B18C5DCA6__GUID-CBD2CC08-E809-47BA-AA48-C55AD35B213B\">\n<p class=\"notep1\">See Also:</p>\n<p><a class=\"olink ADMIN13740\" target=\"_blank\" href=\"../ADMIN/managing-undo.htm#ADMIN13740\"><span class=\"italic\">Oracle Database Administrator's Guide</span></a> for information on managing temporary undo</p>\n</div>\n</div>\n<!-- class=\"section\" --></div>\n</div>\n<!-- class=\"ind\" --><!-- Start Footer -->\n</div>\n<!-- add extra wrapper close div-->", "seealso" : [ "<p><a class=\"olink ADMIN13740\" target=\"_blank\" href=\"../ADMIN/managing-undo.htm#ADMIN13740\"><span class=\"italic\">Oracle Database Administrator's Guide</span></a> for information on managing temporary undo</p>" ] }